frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `role`, `status`, `created_at`, `updated_at`) VALUES ('test2s', 'justinjeralssssd143@gmail.com', '$2y$13$Pyuy786yCmblZlDxY8E6ausafiZBIGPUxvJJsmmvwgvaV.z9K6zAq', 'ZmUVz70MFB18iBnmdy42rY9fZWp-Y37l', 1, 10, '1545473650', '1545473650')
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->role = '1';
        return $user->save() ? $user : null;